import pandas as pd
from pandas import Series, DataFrame

user_df = pd.read_csv('userdata.csv', index_col=0, encoding='shift_jis')
print(user_df)
print(type(user_df))

# 症状(オンライン、来院)
#############################################################################################################
# 内科
sym_internal_onl = ['身体のだるさ', '鼻水', 'のどの痛み', '咳']
sym_internal_vis = ['発熱', '腹痛', '神経痛']


# 外科
sym_surgery_onl = ['動かすと痛み', '肌の痛み', 'にきび']
sym_surgery_vis = ['動かすとかなりの痛み', '出血']

# 耳鼻科
sym_otorhin_onl = ['くしゃみ', '鼻水', '目のかゆみ', '花粉症']
sym_otorhin_vis = ['頭痛', '耳の痛み', '聞こえが悪い', '発熱']


# 眼科
sym_ophthal_onl = ['目のかゆみ', 'めやに', 'アレルギー']
sym_ophthal_vis = ['目の痛み', '目のかすみ', '充血']


#############################################################################################################


# 診察結果
#############################################################################################################
# 内科
res_internal_onl = ['風邪', '疲労']
res_internal_vis = ['インフルエンザ', 'コロナの疑い', '熱']

# 外科
res_surgery_onl = ['突き指', '日焼け', 'にきび']
res_surgery_vis = ['骨折', '捻挫', '擦り傷', '刺し傷']

# 耳鼻科
res_otorhin_onl = ['花粉症', '風邪', 'アレルギー']
res_otorhin_vis = ['中耳炎', 'コロナの疑い', '熱']


# 眼科
res_ophthal_onl = ['花粉症', 'ドライアイ', 'アレルギー']
res_ophthal_vis = ['結膜炎', 'ものもらい']


#############################################################################################################


# データ結合
#############################################################################################################















#############################################################################################################







